In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
data=pd.read_csv('amazon.csv',encoding="iso-8859-1",parse_dates=['date'])
data.dtypes

year               int64
state             object
month             object
number           float64
date      datetime64[ns]
dtype: object

In [3]:
data.head(10)

   year state    month  number       date
0  1998  Acre  Janeiro     0.0 1998-01-01
1  1999  Acre  Janeiro     0.0 1999-01-01
2  2000  Acre  Janeiro     0.0 2000-01-01
3  2001  Acre  Janeiro     0.0 2001-01-01
4  2002  Acre  Janeiro     0.0 2002-01-01
5  2003  Acre  Janeiro    10.0 2003-01-01
6  2004  Acre  Janeiro     0.0 2004-01-01
7  2005  Acre  Janeiro    12.0 2005-01-01
8  2006  Acre  Janeiro     4.0 2006-01-01
9  2007  Acre  Janeiro     0.0 2007-01-01

In [4]:
data.tail(10)

      year      state     month  number       date
6444  2007  Tocantins  Dezembro    13.0 2007-01-01
6445  2008  Tocantins  Dezembro     7.0 2008-01-01
6446  2009  Tocantins  Dezembro    46.0 2009-01-01
6447  2010  Tocantins  Dezembro    72.0 2010-01-01
6448  2011  Tocantins  Dezembro   105.0 2011-01-01
6449  2012  Tocantins  Dezembro   128.0 2012-01-01
6450  2013  Tocantins  Dezembro    85.0 2013-01-01
6451  2014  Tocantins  Dezembro   223.0 2014-01-01
6452  2015  Tocantins  Dezembro   373.0 2015-01-01
6453  2016  Tocantins  Dezembro   119.0 2016-01-01

In [5]:
data.shape

(6454, 5)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6454 non-null   int64
 1   state   6454 non-null   object
 2   month   6454 non-null   object
 3   number  6454 non-null   float64
 4   date    6454 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 252.2+ KB

In [7]:
dup_data=data.duplicated().any()
print("Are there any duplicate variance?",dup_data)
data=data.drop_duplicates()
data.shape

Are there any duplicate variance? True

(6422, 5)

In [8]:
data.isnull().sum()

year      0
state     0
month     0
number    0
date      0
dtype: int64

In [9]:
data.describe()

              year       number                           date
count  6422.000000  6422.000000                           6422
mean   2007.490969   108.815178  2007-06-29 10:46:40.622859008
min    1998.000000     0.000000            1998-01-01 00:00:00
25%    2003.000000     3.000000            2003-01-01 00:00:00
50%    2007.000000    24.497000            2007-01-01 00:00:00
75%    2012.000000   114.000000            2012-01-01 00:00:00
max    2017.000000   998.000000            2017-01-01 00:00:00
std       5.731806   191.142482                            NaN

In [10]:
data.groupby('state')['number'].mean().sort_values(ascending=False)

state
Sao Paulo           213.896226
Mato Grosso         203.479975
Bahia               187.222703
Piau                158.174674
Goias               157.721841
Minas Gerais        156.800243
Tocantins           141.037176
Amazonas            128.243218
Ceara               127.314071
Paraiba             111.073979
Maranhao            105.142808
Pará                102.561272
Pernambuco          102.502092
Roraima             102.029598
Santa Catarina      101.924067
Amapa                91.345506
Rondonia             84.876272
Acre                 77.255356
Rio                  64.698515
Espirito Santo       27.389121
Alagoas              19.271967
Distrito Federal     14.899582
Sergipe              13.543933
Name: number, dtype: float64